benchmark_result/bench_result_hadware_evol/fio/xen_4_12_0/vm8/fio_result/round7/rand_write_throughput
rand_write_throughput: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.1
Starting 4 processes

rand_write_throughput: (groupid=0, jobs=4): err= 0: pid=18698: Fri Jun 21 09:42:59 2024
  write: IOPS=461, BW=466MiB/s (489MB/s)(27.3GiB/60016msec)
    slat (usec): min=412, max=3500.8k, avg=8574.34, stdev=126509.51
    clat (msec): min=4, max=3938, avg=541.76, stdev=994.56
     lat (msec): min=6, max=3945, avg=550.31, stdev=1001.50
    clat percentiles (msec):
     |  1.00th=[  105],  5.00th=[  130], 10.00th=[  146], 20.00th=[  165],
     | 30.00th=[  178], 40.00th=[  188], 50.00th=[  199], 60.00th=[  211],
     | 70.00th=[  228], 80.00th=[  255], 90.00th=[ 3071], 95.00th=[ 3373],
     | 99.00th=[ 3775], 99.50th=[ 3876], 99.90th=[ 3943], 99.95th=[ 3943],
     | 99.99th=[ 3943]
   bw (  KiB/s): min= 2048, max=415744, per=52.24%, avg=249325.49, stdev=107315.38, samples=228
   iops        : min=    2, max=  406, avg=243.29, stdev=104.75, samples=228
  lat (msec)   : 10=0.02%, 20=0.09%, 50=0.29%, 100=0.53%, 250=78.47%
  lat (msec)   : 500=10.57%, 750=0.02%, >=2000=10.91%
  cpu          : usr=2.36%, sys=7.02%, ctx=44981, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.5%, >=64=107.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,27715,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=466MiB/s (489MB/s), 466MiB/s-466MiB/s (489MB/s-489MB/s), io=27.3GiB (29.3GB), run=60016-60016msec

Disk stats (read/write):
  xvda: ios=0/239731, merge=0/22, ticks=0/3872752, in_queue=1595056, util=43.24%